# module_2_4

# Исходный список чисел
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

# Создание пустых списков для простых и непростых чисел
primes = []
not_primes = []

# Перебор каждого числа в исходном списке
for number in numbers:
    # Пропускаем число 1, так как оно не является ни простым, ни не простым
    if number > 1:
        # Переменная, которая означает, что число является простым
        is_prime = True
        # Проверка делителей числа от 2 до самого числа
        for i in range(2, int(number)):
            # Если найден делитель, значит число не является простым
            if number % i == 0:
                is_prime = False
        # В зависимости от значения переменной добавляем число в соответствующий список
        if is_prime == True:
            primes.append(number)
        else:
            not_primes.append(number)

# Вывод списка простых чисел на экран
print("Primes:", primes)

# Вывод списка непростых чисел на экран
print("Not Primes:", not_primes)