# module_2_hard
def generate_password(n): # Создаём функцию которая принимает значение n из генерации пароля
    result = ""  # Создаём строку для хранения итогового пароля
    pairs = []   # Создаём список для хранения уникальных пар чисел

    # Два вложенных цикла для генерации всех уникальных пар чисел от 1 до 20
    for i in range(1, 21): # Цикл пока i в пределах от 1 до 21
        for j in range(i + 1, 21): # Вложенный цикл пока j от i+1 до 21
            pair_sum = i + j  # Вычисляем суммы текущей пары i и j
            if n % pair_sum == 0:  # Проверка, кратно ли n сумме пары
                pair_str = f"{i}{j}"  # Создаем переменную строки результата и присваиваем строку из двух чисел i и j
                if pair_str not in pairs: # Проверка, содержится ли уже эта пара в списке
                    pairs.append(pair_str)  # Если нет — добавляем пару в список
                    result += pair_str  # Добавляем пару в результирующую строку

    return result  # Возвращаем итоговую строку с паролем

# Примеры вызова функции для значений от 3 до 20
for test_number in range(3, 21):
    password = generate_password(test_number)  # Генерация пароля для текущего числа
    print(f"{test_number} - {password}")  # Выводим номер и соответствующий пароль